//? 1 Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

// let arr = ["a", "b", "c"];
// arr.push(1, 2, 3);
// console.log(arr);

//? 2 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// let arr1 = [1, 2, 3];
// let arr2 = [4, 5, 6];
// console.log(arr1.concat(arr2));

//? 3 Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// let arr = [1, 2, 3];
// arr.push(4, 5, 6);
// console.log(arr);

//? 4 Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// let arr = [1, 2, 3]
// arr.unshift(4, 5, 6)
// console.log(arr);

//? 5 Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// let arr = ['js', 'css', 'jq']
// console.log(arr.shift());

//? 6 Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// let arr = ['js', 'css', 'jq']
// console.log(arr.pop());

//? 7  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// let arr = [1, 2, 3, 4, 5];
// console.log(arr.slice(0, 3));

//? 8  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].

// let arr = [1, 2, 3, 4, 5];
// console.log(arr.slice(3));

//? 9  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 2);
// console.log(arr);

//? 10  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(0, 1);
// arr.splice(3, 1);
// console.log(arr);

//? 11  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, "a", "b", "c");
// console.log(arr);

//? 12  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// let arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, "a", "b");
// arr.splice(6, 0, "c");
// arr.splice(8, 0, "e");
// console.log(arr);

//? 13  Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

//? 14 биринчи элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];

// function getFirst(array) {
//   return array[0];
// }
// console.log(getFirst([1, 2, 3, 4, 5, 6, 7, 8, 9]));

//////////////////////

//? 15 акыркы элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];

// function getLast(array) {
//     return array[array.lenght -1 ];
// }
// console.log(getLast([1, 2, 3, 4, 5, 6, 7, 8, 9]));