// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.

// let num = 5
// console.log(num);

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.

// let a = 10;
// let b = 2;
// let c = 5;
// console.log(a + b + c);

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.

// let a = 100;
// console.log(a * 2);

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
// 10. Вам даны переменные name='Аскар', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.

// 1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.
// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.
// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.

// let name = "saykal";
// console.log(`Привет, ${name}!`);

// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.
// 5. Вам даны четыре переменные.
// Первая - для хранения количества дней. Присвойте ей значение "365".
// Вторая - для хранения названия нашей планеты "Земля".
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// Четвертая - для хранения слова "Солнце".
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."

// 2. Вам дан 2 переменные, которая принимает две строки и объединяет их в одну.

// 3. Вам дан переменные, которая принимает строку и возвращает количество слов в этой строке.

// let str = "hello";
// console.log(str.length);

// 4. Вам дан переменные, которая принимает строку с пробелами в качестве аргумента и удаляет все пробелы из нее.

// 6. Вам дан переменные, которая принимает строку в качестве аргумента и возвращает ее в верхнем регистре.
// 7. вам дана строка со значением ' motion web academy '. Удалите все пробелы в строке //output : 'motionwebacademy'
// 8. вам дана строка со значением "motion web" . Измените web на academy // output : 'motion academy'
// 9. вам дана строка "motion web". Выведите в консоль слово web в верхнем регистре // output : 'motion WEB'
// 10. вам дана строка "motion web". Выведите в консоль слово web в верхнем регистре // output : 'motion WEB'
// 11. вам дана строка 'MOTION'. Выведите в консоль первую букву в верхнем регистре, а остальные в нижнем регистре // output : 'Motion'
// 12. вам дана строка "motion web". Измените текст с помощью методов slice , concat // output : 'motion academy'
// 13. вам дана строка "motion". Выведите все буквы "о" в верхнем регистре // output : "mOtiOn"

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне  год", "Мне  лет", в зависимости от возраста. Наример мне 21 год, мне 20 лет.
// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте условие, по которому время будет делиться на четверти. Пример: time = 12 - Первая четверть. Если число больше 60, то в консоли будет выдаваться "Неверное число".

// //! Задание 1
// // Создайте переменные firstNum, secondNum, thirdNum и присвойте им числовые значения.
// // Выведите в консоль число с наибольшим значением.
// // Например: если в firstNum будет хранится число 5, в secondNum 3,
// // а в thirdNum 16, то вывод в консоль должен быть:
// // Максимальное число 16
// // Учтите возможность равенства всех трех чисел.

// //! Задание 2
// // Создайте переменную lang и присвойте ей значение
// // en или ru или de или kg используя тернарный оператор
// // выведите сообщение в зависимости от значения lang
// // lang = 'en' выведет 'This is english'
// // lang = 'ru' выведет 'Это русский'
// // lang = 'de' выведет 'Das ist Deutsch'
// // lang = 'kg' выведет 'Бул кыргыз тили'

// //! Задание 3
// let price = 600; // присваиваем значение цены
// let discount = 15; // присваиваем значение скидки

// //! Задание 4. Напишите программу, которая будет принимать 2 значения через prompt:
// // первое - размер зарплаты сотрудника, второе: стаж работы. В случае, если стаж работы меньше 1 года, надбавка не начисляется, в случае если стаж работы от 1 до 3х лет, надбавка будет 10%, если стаж работы от 3х до 5 лет, то надбавка 15%, в случае, если стаж работы от 5 лет и более, надбавка будет 20%. В итоге в alert вам нужно вывести величину зарплаты с учетом надбавки

// //! Задание 5
// Напишите программу, которая проверяет, является ли введенное число четным или нечетным, используя оператор «%». Выведите «Число ${число} четное», если число делится на 2. Иначе выведите «Число ${число} нечетное», если число возвращает остаток при делении на 2

// //! Задание 6
// Напишите код, который будет спрашивать логин с помощью prompt.
// // Если посетитель вводит «Админ», то prompt запрашивает пароль, если ничего не введено или нажата клавиша Esc – показать «Отменено», в противном случае отобразить «Я вас не знаю».

// // Пароль проверять так:

// // Если введён пароль «Я главный», то выводить «Здравствуйте!»,
// // Иначе – «Неверный пароль»,
// // При отмене – «Отменено».

// // Подсказка: передача пустого ввода в приглашение prompt возвращает пустую строку ''. Нажатие клавиши Esc во время запроса возвращает null.

// //! Задание 7
// Используя тернарный оператор выведите в консоли прогноз погоды. К примеру, если переменная temperature равна -10, вывести "Температура воздуха опустится до -10 градусов".

// 1.Напишите программу, которая определяет, является ли число четным или нечетным.
// 2.Напишите программу, которая возвращает большее из двух чисел.
// 3.Напишите программу, которая определяет, является ли заданное число положительным, отрицательным или нулем.
// 4.Напишите программу, которая определяет тип переданного значения (число, строка, и т.д.).
// 5.Напишите программу, которая находит максимальное число из трех заданных.
// 6.Напишите программу, которая определяет день недели по заданному номеру (1 - понедельник, 2 - вторник и так далее).

// 1.Напишите программу, которая определяет, является ли число положительным.
// 2.Напишите программу, которая проверяет, является ли число четным.
// 3.Напишите программу, которая определяет, является ли число отрицательным.
// 4.Напишите программу, которая определяет, является ли строка пустой.
// 5.Напишите программу, которая проверяет, является ли заданное число равным 0.
// 6.Реализуйте программу, которая определяет, является ли число меньше 10.
// 8.Создайте программу, которая определяет, является ли число четным и делится на 3.
// 9.Напишите программу, которая проверяет, является ли число положительным и нечетным.
// 10.Напишите программу, которая проверяет, является ли строка длиннее 5 символов.
// 11.Создайте программу, которая определяет, является ли число положительным и меньше 100.
// 12.Напишите программу, которая проверяет, является ли число кратным 4 или 6.
// 13.Напишите программу, которая определяет, является ли число кратным 9 и нечетным.
// 14.Напишите программу, которая проверяет, является ли строка "hello".

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне  год", "Мне  лет", в зависимости от возраста. Наример мне 21 год, мне 20 лет.
// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте условие, по которому время будет делиться на четверти. Пример: time = 12 - Первая четверть. Если число больше 60, то в консоли будет выдаваться "Неверное число".

// 1.Напишите программу, которая определяет, является ли число положительным.
// 2.Напишите программу, которая проверяет, является ли число четным.
// 3.Напишите программу, которая определяет, является ли число отрицательным.
// 4.Напишите программу, которая определяет, является ли строка пустой.
// 5.Напишите программу, которая проверяет, является ли заданное число равным 0.
// 6.Реализуйте программу, которая определяет, является ли число меньше 10.
// 8.Создайте программу, которая определяет, является ли число четным и делится на 3.
// 9.Напишите программу, которая проверяет, является ли число положительным и нечетным.
// 10.Напишите программу, которая проверяет, является ли строка длиннее 5 символов.
// 11.Создайте программу, которая определяет, является ли число положительным и меньше 100.
// 12.Напишите программу, которая проверяет, является ли число кратным 4 или 6.
// 13.Напишите программу, которая определяет, является ли число кратным 9 и нечетным.
// 14.Напишите программу, которая проверяет, является ли строка "hello".

// 1  Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// 2 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// 3 Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// 4 Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// 5 Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
// 6 Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
// 7  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// 8  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].
// 9  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// 10  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

// 11  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// 12  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// 13  Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

// 14 биринчи элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];

//  function getFirst(array) {
//     ваш код

// };
// 15 акыркы элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];

//  function getLast(array, n) {
//     ваш код
// };

// Во всех задачах используйте только методы map, filter.

// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.
// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, изменяющую букву а в каждом имени на я и выведите в консоль.
// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, которая выводит только те имена, где есть буква к и выведите в консоль.
// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив, состоящий из квадратов этих чисел.
// 5. Вам дан массив [3134, 4, -143, -245, -214]. Оставьте в нем только отрицательные числа.
// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.
// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа. Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
// 10. Вам дан массив [55, 44, 55, 44, 15, 49]. Оставьте в нем только неповторяющиеся числа.
// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null]. Создайте функцию, которая очищает массив от ложных (false) значений: false, null, undefined, 0, –0, NaN и "" (пустая строка).
// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.

// Во всех задачах используйте только методы map, reduce.
// 1. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму этих чисел.
// 2. Вам дан массив с числами [5,12,314,2,13,20,9]. Найдите сумму всех четных чисел.
// 3. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму чисел, которые больше 10.
// 4. Вам дан массив с числами [3,13,54,15,335, 39]. Найдите разность чисел, которые больше 10.
// 5. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Сложите все строки и выведите длину результата.
// 6. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Выведите все строки в верхнем регистре, используя map.
// 7. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Выведите все вторые строки в верхнем регистре.
// 8. Напишите функцию, которая принимает str, target. И возвращает true или false, если targer присутствует в str. Использовать .reduce для этого.
// Пример: isPresent ('abcd', 'b') => true
// isPresent ('efghi', 'a') // => false
// 9. Вам дан массив с строками ['асКар', 'бЯяман', 'калМмамат']. Используйте заглавные буквы в каждом массиве имен.
// Пример: (["john", "JACOB", "jinGleHeimer", "schmidt"])), => ["John", "Jacob", "Jingleheimer", "Schmidt"]
// 10. Вам дан массив со строками ['Баяман', 'Калмамат']. Поменяйте местами первые буквы строк.
// 11. Вам дан массив [true, '1234', 325]. Напишите функцию, которая проверяет, все ли элементы массива относятся к одному типу данных.
// 12. Вам дана строка 'тестинг'. Ваша задача - вернуть средний символ слова. Если длина слова нечетная, верните средний символ. Если длина слова четная, вернуть 2 средних символа.
// 13. Вам дан массив с числами [5, -3, 13, -7, 45]. Верните сумму всех положительных чисел.
// 14. Вам дан массив с числами [5, -54, 13, -7, 45, -15, -34]. Верните сумму всех отрицательных чисел, которые больше 10.
// 15. Вам дан массив с числами [1, 65, 13 , 30, 100] - все числа - доллары. Вам нужно обменять эти доллары по курсу сома и вывести все числа в сомах.
// 16. Вам дан массив со строками ['Lorem ipsum dor sit omet devour il ela sit']. Выведите каждый нечетный индекс в строке в верхнем регистре.
// 17. Вам дан массив с строками ['Оскар', 'Баяман', 'Калмамат']. Добавьте к каждой строке нумерацию.
// 18. Вам дан массив с числами [2,456,6,8]. Напишите функцию , которая вставляет дефис (-) между каждыми двумя четными числами. Например, если вы принимаете 025468, на выходе должно быть 0-254-6-8.
// 20. Вам дан массив с числами [5,15,315,2,13,20,9]. Посчитайте среднее арифметическое чисел в массиве.

// 1. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму этих чисел.
// 2. Вам дан массив с числами [5,12,314,2,13,20,9]. Найдите сумму всех четных чисел.
// 3. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму чисел, которые больше 10.
// 4. Вам дан массив с числами [3,13,54,15,335, 39]. Найдите разность чисел, которые больше 10.
// 5. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Сложите все строки и выведите длину результата.

////////////////////////////

//! Разделение строки по пробелам
// Разделите строку на массив слов, используя пробел в качестве разделителя.
// let sentence = "Это пример разделения строки на слова";

// let sentence = "Это пример разделения строки на слова";
// let res = sentence.split(" ");
// console.log(res);

//! Извлечение чисел:
// Напишите функцию, которая принимает строку, содержащую числа, разделенные запятыми. Используя split(), извлеките числа и верните их в виде массива.

// function task(str) {
//   return str.split(" ");
// }
// console.log(task("1,2,3,4,5"));

//! Разбиение предложения:
// Создайте функцию, которая принимает предложение и разбивает его на отдельные фразы, используя split(). Затем выведите каждую фразу на новой строке.

// function task1(str) {
//   return str.split(" ");
// }
// console.log(
//   task1(
//     "Это предложение разделено на несколько фраз. Каждая фраза будет выведена на отдельной строке. Вот так."
//   )
// );

//! Объединение элементов массива:
// Напишите функцию, которая принимает массив строк и объединяет их в одну строку с помощью метода join(). Например, объедините массив ['Hello', 'world'] в строку 'Hello world'.

// function task2(str) {
//   return str.join(" ");
// }
// console.log(task2(["Hello", "world"]));

//! Форматирование времени:
// Напишите функцию, которая принимает время в виде отдельных часов, минут и секунд, а затем использует join() для объединения этих данных в строку времени в формате “часы:минуты:секунды”.

// let hours = 12;
// let minutes = "05";
// let secound = 25;

// let res = [hours, minutes, secound];
// function task() {
//   return res.join(":");
// }
// console.log(task());

//! Создание строки номеров телефонов:
// Представьте, что у вас есть массив номеров телефонов. Напишите функцию, которая преобразует эти номера в строку, используя метод join(), чтобы объединить их, разделив запятыми.

// let arr = ["+996 557445667", "+996 223578754"];
// let res = arr.join(", ");
// console.log(res);

//! Формирование названий:
// Создайте функцию, которая принимает массив строк и формирует новую строку, объединяя первую букву каждого элемента в верхнем регистре с остальной частью слова. Используйте join() для объединения измененных строк в одну.
// let words = ["apple", "banana", "cherry", "date"];


// let words = ["apple", "banana", "cherry", "date"];
// let res = words.map((el) => {
//   return el.charAt(0).toUpperCase() + el.slice(1);
// });
// console.log(res.join(" "));

//   TODO 4. Напишите функцию, чтобы она нашла среднее значение трех переданных ей баллов и вернула буквенное значение, связанное с этой оценкой.
//  90 <= оценка <= 100 «А»
//  80 <= оценка < 90 «В»
//  70 <= оценка < 80 «С»
//  60 <= оценка < 70 «D»
//  0 <= оценка < 60  «F»

// function str(score1, score2, score3) {
//   let res = (score1 + score2 + score3) / 3;

//   if (res >= 90) {
//     return "A";
//   } else if (res >= 80) {
//     return "B";
//   } else if (res >= 70) {
//     return "C";
//   } else if (res >= 60) {
//     return "D";
//   } else {
//     return "F";
//   }
// }

// let score1 = 85;
// let score2 = 90;
// let score3 = 75;
// let grade = str(score1, score2, score3);
// console.log("Средняя оценка:", grade);

//! Напишите функцию для преобразования имени в инициалы. Аргумент в видес строки  строго состоит из двух слов с одним пробелом между ними. На выходе должны быть две заглавные буквы с точкой, разделяющей их. Это должно выглядеть так:

// Sam Harris => S.H
// patrick feeney => P.F

// function task(name) {
//   let words = name.split(" ");

//   let res = words.map((el) => {
//     return el.charAt(0).toUpperCase();
//   });

//   let result = res.join(".");
//   return result;
// }

// console.log(task("Sam Harris"));
// console.log(task("patrick feeney"));
// console.log(task("sarylbekova saykal"));

//! Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, и зменяющую букву а в каждом имени на я и выведите в консоль.

// let arr = ["Аскар", "Баяман", "Калмамат"];

// let res = arr.join(" ").replaceAll("а", "я");
// console.log(res);

//! 7. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат', 'Ben'].
// Выведите все вторые строки в верхнем регистре.

// let arr = ["Аскар", "Баяман", "Калмамат", "Ben"];
// let res = arr.join(" ").toUpperCase();
// console.log(res);

//! Проверка наличия элементов, удовлетворяющих условию
// Используйте метод some(), чтобы проверить, есть ли в массиве хотя бы один элемент, удовлетворяющий определенному условию.
// let numbers = [10, 5, 8, 22, 3];

// let numbers = [10, 5, 8, 22, 3];
// let res = numbers.some((el) => el > 20);
// console.log(res);

//! Сортировка строк в лексикографическом порядке
// Используйте метод sort(), чтобы отсортировать массив строк в лексикографическом порядке (по алфавиту).
// let fruits = ["banana", "apple", "cherry", "date"];

// let arr = ["banana", "apple", "cherry", "date"];
// let res = arr.sort((a, b) => {
//   if (a > b) {
//     return 1;
//   } else {
//     return -1;
//   }
// });
// console.log(res);

//! Сортировка строк в обратном порядке
// Используйте метод sort() и функцию сравнения для отсортировки массива строк в обратном порядке
// let fruits = ["banana", "apple", "cherry", "date"];

// let arr = ["banana", "apple", "cherry", "date"];
// let res = arr.sort((a, b) => {
//   if (a < b) {
//     return 1;
//   } else {
//     return -1;
//   }
// });
// console.log(res);

//! Проверка наличия элемента больше определенного порога
// Используйте метод some(), чтобы проверить, есть ли в массиве хотя бы один элемент больше 15
// let numbers = [10, 5, 8, 22, 3];

// let numbers = [10, 5, 8, 22, 3];
// let res = numbers.some((el) => el > 15);
// console.log(res);

//! Поиск элемента в массиве
// Создайте массив чисел и используйте метод find(), чтобы найти первый элемент, который больше  25 определенного порогового значения.
// let numbers = [10, 20, 30, 40, 50];

// let numbers = [10, 20, 30, 40, 50];
// let res = numbers.find((el) => el > 25);
// console.log(res);

//! Преобразование данных
// Создайте массив чисел и используйте метод map(), чтобы преобразовать числа в строковый формат с добавлением символа "$" в начале каждой строки.
// let prices = [10, 20, 30, 40, 50];

// let prices = [10, 20, 30, 40, 50];
// let res = prices.map((el) => "$" + el).join(" ");
// console.log(res);

//!

// let arrUser = [
//   {
//     id: 1,
//     name: "Azat",
//     age: 23,
//     job: "Developer",
//   },
//   {
//     id: 2,
//     name: "Amantur",
//     age: 19,
//     job: "Developer",
//   },
//   {
//     id: 3,
//     name: "Nurgazy",
//     age: 22,
//     job: "Developer",
//   },
//   {
//     id: 4,
//     name: "Uson",
//     age: 17,
//     job: "Developer",
//   },
//   {
//     id: 5,
//     name: "Nurdan",
//     age: 20,
//     job: "Developer",
//   },
//   {
//     id: 6,
//     name: "Aziret",
//     age: 16,
//     job: "Developer",
//   },
// ];

// let res1 = arrUser.map((el) => {
//   return el.name;
// });
// console.log(res1);

// let arr = arrUser.filter((el) => {
//   return el.age > 18;
// });
// console.log(arr);

// let res = arrUser.map((el, idx) => {
//   if (idx % 2 !== 0) {
//     el.hobby = "sport";
//     return el;
//   } else {
//     return el;
//   }
// });
// console.log(res);

// arrUser.find((el) => el.name === "Uson").name = "Asan";
// console.log(arrUser);

//! Выведет все числа из массива, кроме 3: 1, 2, 4, 5
// let numbers = [1, 2, 3, 4, 5];

// let numbers = [1, 2, 3, 4, 5];
// let res = numbers.filter((el) => el !== 3);
// console.log(res);
