//! ternarny operator

//? ? -- if - если
//? : -- else - иначе 


// Тернарный оператор в JavaScript - это сокращенная форма условного оператора if-else.
// Он позволяет вам написать условное выражение в более компактной форме.

// условие ? выражение_если_истина : выражение_если_ложь;


// let age = 25;
// let message = (age >= 18) ? "Совершеннолетний" : "Несовершеннолетний";

// console.log(message); // Выведет "Совершеннолетний"




// Тернарный оператор полезен, когда необходимо принять простое решение на основе 
// какого-то условия и присвоить значение переменной в зависимости от этого условия.